Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition Constructor
 Creates a new hierarchical definition instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public HierarchicDefinition()
Public Sub New
See Also
Reference
HierarchicDefinition Class
HierarchicDefinition Overload
Tekla.Structures.Model Namespace